app/Controllers/Customer.php

INSERT INTO `customers` (`name`, `email`, `photo`, `created_at`, `updated_at`) VALUES ('data baru', 'databaru@mail.com', 'avatar5.png', '2023-07-28 00:44:05', '2023-07-28 00:44:05')
---
    public function save()
    {
        if (!$this->validate([
            'name' => [
                'rules' => 'required'
            ],
            'email' => [
                'rules' => 'required'
            ],
            'photo' => [
                'rules' => 'uploaded[photo]',
                'max_size[photo,1024]',
                'is_image[photo]',
                'mime_in[photo,image/jpg,image/jpeg,image/png]'
            ],
        ])) {
            return redirect()->to('/')->withInput();
        }
        $file_photo = $this->request->getFile('photo');
        $file_photo->move('dist/img', $file_photo->getName());

        $this->customers->save([
            'name' => $this->request->getVar('name'),
            'email' => $this->request->getVar('email'),
            'photo' => $file_photo->getName(),
        ]);

UPDATE `customers` SET `name` = 'data new', `email` = 'datanew@mail.com', `photo` = 'avatar4.png', `updated_at` = '2023-07-28 00:57:12'
WHERE `customers`.`id` IN ('19')
---
    public function update($id)
    {
        // if (!$this->validate([
        //     'name' => [
        //         'rules' => 'required'
        //     ],
        //     'email' => [
        //         'rules' => 'required'
        //     ],
        //     'photo' => [
        //         'rules' => 'uploaded[photo]',
        //         'max_size[photo,1024]',
        //         'is_image[photo]',
        //         'mime_in[photo,image/jpg,image/jpeg,image/png]'
        //     ],
        // ])) {
        //     return redirect()->to('/')->withInput();
        // }
        $file_photo = $this->request->getFile('photo');
        $file_photo->move('dist/img', $file_photo->getName());

        $this->customers->save([
            'id' => $id,
            'name' => $this->request->getVar('name'),
            'email' => $this->request->getVar('email'),
            'photo' => $file_photo->getName(),
        ]);