app/Models/CustomersModel.php

SELECT *
FROM `customers`
SELECT *
FROM `customers`
WHERE `id` = '19'
 LIMIT 1
---
    public function getCustomer($id = false)
    {
        if (!$id) {
            return $this->findAll();
        }

        return $this->where(['id' => $id])->first();